# Introduction

### Project initialization and setup

Importing all of the libraries that will be used. In the project.

In [5]:
import sqlite3
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

Display options (make this clearer)

In [6]:

pd.set_option("display.max_columns", 100)
pd.set_option("display.width", 120)

Explain what this is

In [7]:
DB_PATH = "viewer_interactions.db"

try:
    conn = sqlite3.connect(DB_PATH)
    print("Connected successfully!")
except sqlite3.Error as e:
    print("Connection failed:", e)

Connected successfully!

Listing all the tables

In [8]:
tables_query = """
               SELECT name
               FROM sqlite_master
               WHERE type='table'
               ORDER BY name; \
               """

tables_df = pd.read_sql_query(tables_query, conn)
print("Tables in the database:")
display(tables_df)

Tables in the database:

               name
0   data_dictionary
1  movie_statistics
2            movies
3   user_statistics
4    viewer_ratings

In [10]:
table_names = tables_df["name"].tolist()

schemas = {}

for table in table_names:
    pragma_query = f"PRAGMA table_info({table});"
    schema_df = pd.read_sql_query(pragma_query, conn)
    schemas[table] = schema_df
    print(f"\nSchema for table '{table}':")
    display(schema_df)

Schema for table 'data_dictionary':

   cid         name  type  notnull dflt_value  pk
0    0   table_name  TEXT        0       None   0
1    1   field_name  TEXT        0       None   0
2    2    data_type  TEXT        0       None   0
3    3  description  TEXT        0       None   0

Schema for table 'movie_statistics':

    cid               name     type  notnull dflt_value  pk
0     0           movie_id  INTEGER        0       None   0
1     1      total_ratings     REAL        0       None   0
2     2         avg_rating     REAL        0       None   0
3     3         std_rating     REAL        0       None   0
4     4         min_rating     REAL        0       None   0
5     5         max_rating     REAL        0       None   0
6     6       unique_users     REAL        0       None   0
7     7  first_rating_date     TEXT        0       None   0
8     8   last_rating_date     TEXT        0       None   0
9     9    year_of_release     REAL        0       None   0
10   10              title     TEXT        0       None   0

Schema for table 'movies':

   cid             name     type  notnull dflt_value  pk
0    0         movie_id  INTEGER        0       None   0
1    1  year_of_release     REAL        0       None   0
2    2            title     TEXT        0       None   0

Schema for table 'user_statistics':

   cid               name     type  notnull dflt_value  pk
0    0        customer_id  INTEGER        0       None   0
1    1      total_ratings     REAL        0       None   0
2    2         avg_rating     REAL        0       None   0
3    3         std_rating     REAL        0       None   0
4    4         min_rating     REAL        0       None   0
5    5         max_rating     REAL        0       None   0
6    6      unique_movies     REAL        0       None   0
7    7  first_rating_date     TEXT        0       None   0
8    8   last_rating_date     TEXT        0       None   0
9    9      activity_days     REAL        0       None   0

Schema for table 'viewer_ratings':

   cid            name     type  notnull dflt_value  pk
0    0        movie_id  INTEGER        0       None   0
1    1     customer_id  INTEGER        0       None   0
2    2          rating     REAL        0       None   0
3    3            date     TEXT        0       None   0
4    4  anomalous_date  INTEGER        0       None   0